10-rails-adv/labs/1-10/05-rails-paperclip-avatar-lab/app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "authors" SET "avatar_updated_at" = ?, "avatar_file_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["avatar_updated_at", "2018-04-04 09:11:10.518862"], ["avatar_file_name", "if_malecostume_403022.png"], ["updated_at", "2018-04-04 09:11:10.567483"], ["id", 8]]
---
  def update
    @author = Author.find(params[:id])
    @author.update(author_params)

INSERT INTO "authors" ("bio", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["bio", "man"], ["name", "Test"], ["created_at", "2016-02-06 16:07:10.399317"], ["updated_at", "2016-02-06 16:07:10.399317"]]
---
  def create
    @author = Author.create(author_params)