08-rails/demo-apps/1-10/09-rails-form_for-lab/app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(post_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2017-11-07 20:06:39.419816"], ["updated_at", "2017-11-07 20:06:39.419816"]]

  def edit
    @school_class = SchoolClass.find_by(id: params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @school_class = SchoolClass.find_by(params[:id])
    @school_class.update(post_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE (1) LIMIT 1
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-11-07 20:58:57.484692"], ["id", 1]]