08-rails/review/1-10/02-rails-form_tag-readme/app/controllers/posts_controller.rb

  def create
    @post = Post.new(title: params[:post][:title], description: params[:post][:description])
    if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)