08-rails/review/1-10/09-rails-form_for-lab-cb-000/app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Biology"], ["room_number", 401]]
---
	def create
		@school_class = SchoolClass.new(school_class_params)
		if @school_class.save

UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]
---
	def update
		if @school_class.update(school_class_params)