08-rails/review/1-10/09-rails-form_for-lab-cb-000/app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "john"], ["last_name", "smith"], ["created_at", "2018-01-23 17:45:11.143340"], ["updated_at", "2018-01-23 17:45:11.143340"]]
---
	def create
		# post :create, { :student => { :first_name => "Bill", :last_name => "Smith" } }
		@student = Student.new(student_params)
		if @student.save

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Jane"], ["last_name", "Smyth"], ["updated_at", "2018-01-23 17:50:05.850557"], ["id", 3]]
---
	def update
		if @student.update(student_params)