10-rails-adv/labs/1-10/07-rails-kaminari-review/app/controllers/authors_controller.rb

INSERT INTO "authors" ("bio", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["bio", "man"], ["name", "Test"], ["created_at", "2016-02-06 16:07:10.399317"], ["updated_at", "2016-02-06 16:07:10.399317"]]
---
  def create
    @author = Author.create(author_params)