10-rails-adv/labs/1-10/07-rails-kaminari-review/app/controllers/posts_controller.rb

	def index
    # retireve posts in 'desc' order, then use kaminari 'page' method to return a page
    @posts = Post.order(created_at: :desc).page(params[:page])
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "posts" LIMIT 10 OFFSET 10) subquery_for_count